nikolareljin/ink-mate/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_NVS_ENCRYPTION=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_WIFI_NVS_ENABLED=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_INKMATE_BOARD_V2=y
CONFIG_INKMATE_ENABLE_DEEP_SLEEP=n
CONFIG_INKMATE_ENABLE_OTA_REBOOT=n
